tests/load-test-dummy.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    - duration: 20
      arrivalRate: 10
      rampTo: 30
      name: Ramp up load
    - duration: 20
      arrivalRate: 40
      name: Sustained load

scenarios:
  - name: "Pie chart"
    flow:
      - get:
          url: "/dummy"